{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/a4d4719a-bcac-4808-8bdf-22237478ade6')]", 
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/a4d4719a-bcac-4808-8bdf-22237478ade6')]", 
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules", 
            "kind": "Scheduled", 
            "apiVersion": "2022-10-01-preview", 
            "properties": {
                "displayName": "ADCS - Certificate Services received a certificate request", 
                "description": "4886 - Certificate Services received a certificate request",  
                "severity": "Low",  
                "enabled": true,  
                "query": "SecurityEvent\r\n| where EventID == 4886\r\n\r\n",
                "queryFrequency": "PT5H",
                "queryPeriod": "PT5H",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,  
                "tactics": [],
                "techniques": [],
                "incidentConfiguration": {  
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": null,
                "sentinelEntitiesMappings": null
            }
        }
    ]
}